//
// Created by brunon on 18-3-25.
//

#ifndef CPPPROGRAM_PROBLEM_H
#define CPPPROGRAM_PROBLEM_H

#include "include.h"

void printNumber(int num) {  //字库,空间换时间
    int word[10][5][5] = {{{1, 1, 1, 1, 1},
                                  {1, 0, 0, 0, 1},
                                  {1, 0, 0, 0, 1},
                                  {1, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1}},
                          {{0, 0, 0, 0, 1},
                                  {0, 0, 0, 0, 1},
                                  {0, 0, 0, 0, 1},
                                  {0, 0, 0, 0, 1},
                                  {0, 0, 0, 0, 1}},
                          {{1, 1, 1, 1, 1},
                                  {0, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1},
                                  {1, 0, 0, 0, 0},
                                  {1, 1, 1, 1, 1}},
                          {{1, 1, 1, 1, 1},
                                  {0, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1},
                                  {0, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1}},

                          {{1, 0, 0, 0, 1},
                                  {1, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1},
                                  {0, 0, 0, 0, 1},
                                  {0, 0, 0, 0, 1}},

                          {{1, 1, 1, 1, 1},
                                  {1, 0, 0, 0, 0},
                                  {1, 1, 1, 1, 1},
                                  {0, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1}},

                          {{1, 1, 1, 1, 1},
                                  {1, 0, 0, 0, 0},
                                  {1, 1, 1, 1, 1},
                                  {1, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1}},

                          {{1, 1, 1, 1, 1},
                                  {0, 0, 0, 0, 1},
                                  {0, 0, 0, 0, 1},
                                  {0, 0, 0, 0, 1},
                                  {0, 0, 0, 0, 1}},

                          {{1, 1, 1, 1, 1},
                                  {1, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1},
                                  {1, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1}},

                          {{1, 1, 1, 1, 1},
                                  {1, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1},
                                  {0, 0, 0, 0, 1},
                                  {1, 1, 1, 1, 1}}};
    int count = 0, temp = num;
    while(0 != temp) {   //统计位数
        count++;
        temp /= 10;
    }
    int record = count*5 + 2*(count-1);
    int** display = new int*[5];
    for(int i=0; i<5; i++)
        display[i] = new int[record];
    int index, j=0;
    for(int i=count; i>=1; i--) {
        index=(num%(int)(pow(10, i)))/pow(10, i-1);//分离公式
        for(int m=0; m<5; m++) {
            for(int n=0; n<5; n++) {
                display[n][m+j*7] = word[index][n][m];
            }
        }
        j++;
    }
    for(int i=0; i<5; i++){
        for(int j=0; j<record; j++) {
            if(display[i][j] == 1) cout << '6';
            else cout << '.';
        }
        cout << endl;
    }
}

#endif //CPPPROGRAM_PROBLEM_H
